export const CONTENT = [
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/3feaa4c0-403d-4148-b58b-c66ed03bc4fe/3feaa4c0-403d-4148-b58b-c66ed03bc4fe-10816053.jpeg',
    title: 'Силовые тренировки',
    description:
      'Мечтаете о подтянутом теле, но боитесь, что допустите ошибок в тренировке без тренера? Мы знаем, как важно не только работать над своей силой, но и видеть изменения в теле. Если вы хотите достичь результатов и стать сильнее — у нас есть решение.',
    btnColor: '#ED7A24',
  },
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/2cdfc71d-2b1f-453c-b190-1c397321de8a/2cdfc71d-2b1f-453c-b190-1c397321de8a-10816052.jpeg',
    title: 'Степ-аэробика',
    description:
      'Хотите получить заряд бодрости и улучшить свою физическую форму? Степ-аэробика — это идеальный способ сжигать калории, укреплять мышцы и при этом получать удовольствие от тренировки!',
    btnColor: '#54C263',
  },
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/01f11479-da0d-4ae0-92e6-a5dd77c99616/01f11479-da0d-4ae0-92e6-a5dd77c99616-10816180.jpeg',
    title: 'Танцевальный фитнес',
    description:
      'Хотите получить удовольствие от движения и забыть о скучных занятиях в зале? Танцевальный фитнес — это веселая и динамичная тренировка, где каждый сможет почувствовать себя звездой танцпола, не задумываясь о том, что это на самом деле эффективный тренинг!',
    btnColor: '#54C263',
  },
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/3ca2cb91-c644-4675-9482-946d60f2a37f/3ca2cb91-c644-4675-9482-946d60f2a37f-10816063.jpeg',
    title: 'Йогалатес',
    description:
      'Хотите похудеть и избавиться от боли в спине, но не знаете, с чего начать? Мы понимаем, как важно не просто тренироваться, а видеть изменения в теле и чувствовать себя лучше. Если вы уже пытались достичь своих целей, но все еще далеки от результата — у нас есть решение.',
    btnColor: '#ED7A24',
  },
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/49e4ca26-39a8-413e-9b38-3517dae4ef3d/49e4ca26-39a8-413e-9b38-3517dae4ef3d-10816092.jpeg',
    title: 'Стретчинг',
    description:
      'Мы знаем, как важно добиться желаемого тела и сделать это эффективно! Если вы уже пытались худеть, растягиваться, пробовали разные тренировки, но ничего не помогло — у нас есть решение.',
    btnColor: '#ED7A24',
  },
];
