import { THEMES } from '../../../components/Button/constants/themes';
import { IContent } from '../components/TrainingDirections/types';

export const CONTENT: IContent[] = [
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/3feaa4c0-403d-4148-b58b-c66ed03bc4fe/3feaa4c0-403d-4148-b58b-c66ed03bc4fe-10816053.jpeg',
    title: 'Силовые тренировки',
    description: [
      'Мечтаете о подтянутом теле, но боитесь, что допустите ошибок в тренировке без тренера?',
      'Мы знаем, как важно не только работать над своей силой, но и видеть изменения в теле. Если вы хотите достичь результатов и стать сильнее — у нас есть решение.',
    ],
    btnTheme: THEMES.orangeFlat,
  },
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/2cdfc71d-2b1f-453c-b190-1c397321de8a/2cdfc71d-2b1f-453c-b190-1c397321de8a-10816052.jpeg',
    title: 'Степ-аэробика',
    description: [
      'Хотите получить заряд бодрости и улучшить свою физическую форму?',
      'Степ-аэробика — это идеальный способ сжигать калории, укреплять мышцы и при этом получать удовольствие от тренировки!',
    ],
    btnTheme: THEMES.greenFlat,
  },
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/01f11479-da0d-4ae0-92e6-a5dd77c99616/01f11479-da0d-4ae0-92e6-a5dd77c99616-10816180.jpeg',
    title: 'Танцевальный фитнес',
    description: [
      'Хотите получить удовольствие от движения и забыть о скучных занятиях в зале?',
      'Танцевальный фитнес — это веселая и динамичная тренировка, где каждый сможет почувствовать себя звездой танцпола, не задумываясь о том, что это на самом деле эффективный тренинг!',
    ],
    btnTheme: THEMES.greenFlat,
  },
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/3ca2cb91-c644-4675-9482-946d60f2a37f/3ca2cb91-c644-4675-9482-946d60f2a37f-10816063.jpeg',
    title: 'Йогалатес',
    description: [
      'Хотите похудеть и избавиться от боли в спине, но не знаете, с чего начать?',
      'Мы понимаем, как важно не просто тренироваться, а видеть изменения в теле и чувствовать себя лучше.',
      'Если вы уже пытались достичь своих целей, но все еще далеки от результата — у нас есть решение.',
    ],
    btnTheme: THEMES.orangeFlat,
  },
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/49e4ca26-39a8-413e-9b38-3517dae4ef3d/49e4ca26-39a8-413e-9b38-3517dae4ef3d-10816092.jpeg',
    title: 'Йога',
    description: [
      'Ищете способ справиться со стрессом, улучшить осанку и обрести внутренний баланс?',
      'Йога — это не просто тренировка, это философия, которая помогает сделать ваше тело сильным, гибким и здоровым, а разум — спокойным и сосредоточенным.',
    ],
    btnTheme: THEMES.orangeFlat,
  },
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/a69c24f4-167a-4740-a7d6-1af28b3d23d6/a69c24f4-167a-4740-a7d6-1af28b3d23d6-12270452.jpeg',
    title: 'Пилатес',
    description: [
      'Хотите укрепить мышцы, улучшить осанку и почувствовать себя сильнее, не перегружая суставы?',
      'Пилатес — это метод тренировки, который бережно работает с вашим телом, помогая развить гибкость, координацию и силу.',
    ],
    btnTheme: THEMES.greenFlat,
  },
  {
    bgImage:
      'https://259506.selcdn.ru/sites-static/site959140/9032be81-60ce-499c-b91f-dced83ce7b30/9032be81-60ce-499c-b91f-dced83ce7b30-12270453.jpeg',
    title: 'JUMPING FITNESS',
    description: [
      'Прыгай, веселись, почувствуй себя ребёнком с пользой!',
      'Кто сказал, что тренировки должны быть скучными? Джампинг фитнес — это возвращение в детство, где каждый прыжок приносит радость и потрясающие результаты.',
    ],
    btnTheme: THEMES.orangeFlat,
  },
];
