export const numberToGenitive = (n: number): string => {
  const words = {
    1: '',
    2: 'двух',
    3: 'трех',
    4: 'четырех',
    5: 'пяти',
    6: 'шести',
    7: 'семи',
    8: 'восьми',
    9: 'девяти',
    10: 'десяти',
    11: 'одиннадцати',
    12: 'двенадцати',
    13: 'тринадцати',
    14: 'четырнадцати',
    15: 'пятнадцати',
    16: 'шестнадцати',
    17: 'семнадцати',
    18: 'восемнадцати',
    19: 'девятнадцати',
    20: 'двадцати',
  } as const;

  return words[n as keyof typeof words] || n.toString(); // Если больше 20, просто возвращаем число
};
