import { IListItem } from '../components/TrainingList';

export const LIST: IListItem[] = [
  {
    title: 'Индивидуальные занятия с тренером под любые цели',
    description: 'Узнай как обращаться с тренажёрами, получи личный план роста и развития',
  },
  {
    title: 'Силовые тренировки',
    description: 'Боль, которую вы чувствуете сегодня, станет силой, которую вы почувствуете завтра',
  },
  {
    title: 'Степ аэробика, танцевальный степ',
    description: 'Кардиотренировка на основе танцевальных движений, выполняемых с помощью степ-платформы',
  },
  {
    title: 'Танцевальный фитнес',
    description: 'Занятия фитнесом ещё никогда не были на столько увлекательными и эффективными, как в танце',
  },
  {
    title: 'Йогалатес',
    description: 'Симбиоз йоги и пилатеса откроет вам техники концентрации, правильного дыхания и владения телом',
  },
  {
    title: 'Стретчинг',
    description: 'Почувствуй как твоё тело становится гибким, лёгким и эластичным',
  },
];
