import { IListItem } from '../types';

export const LIST: IListItem[] = [
  {
    title: 'Индивидуальные занятия с тренером под любые цели',
    description: 'Узнай как обращаться с тренажёрами, получи личный план роста и развития 🎯',
  },
  {
    title: 'Силовые тренировки',
    description: 'Боль, которую вы чувствуете сегодня, станет силой, которую вы почувствуете завтра 💪',
  },
  {
    title: 'Степ аэробика, танцевальный степ',
    description: 'Кардиотренировка на основе танцевальных движений, выполняемых с помощью степ-платформы 🕺',
  },
  {
    title: 'Зумба',
    description: 'Занятия фитнесом ещё никогда не были на столько увлекательными и эффективными, как в танце 💃',
  },
  {
    title: 'Йогалатес',
    description: 'Симбиоз йоги и пилатеса откроет вам техники концентрации, правильного дыхания и владения телом 🌿',
  },
  {
    title: 'Йога',
    description: 'Гармония тела и разума, наполни себя энергией, силой и внутренним спокойствием 🧘‍♂️',
  },
  {
    title: 'Пилатес',
    description: 'Улучши осанку, укрепи мышцы и ощути лёгкость в каждом движении! ✨',
  },
  {
    title: 'Jumping Fitness',
    description: 'Зарядись энергией, прокачай выносливость и ощути лёгкость в каждом прыжке! 🚀',
  },
];
